"""Ця програма створена для розрахунку нумероскопу по ситемі Піфагора. Увівши свою дату народження,
можна дізнатися ті характеристики, якими була наділена людина від початку свого життя."""

from tkinter import *
# створюємо вікно
 
root = Tk()
root.geometry("500x600") #розмір вікна
root.title('Нумероскоп по системі Піфагора') #називаю вікно

#мій величезний словник розшифрування нумерологічного коду
numb_values = {'1': '"Одиниці" - характер',
              '01': 'немає 1',
              '11': 'один із найскладніших характерів. Така людина - витончений егоїст',
              '21': "зазвичай м'який характер. Добре взаємодіють з іншими людьми, \n люблять хвалити себе",
              '31': 'Характер спокійний, зрівноважений. В житті активні.',
              '41': 'Стабільний, спокійний, вольовий характер.\nСамодостатні, зрівноважені.',
              '51': 'Диктатор, має дуже сильный характер. Наполегливий у намірах',
              '61': 'Рідкісний варіант. Жорстокий, але для близьких може здіснити неможливе',
              '71': 'Рідкісний варіант. Жорстокий, але для близьких може здіснити неможливе.',
              '81': 'Рідкісний варіант. Жорстокий, але для близьких може здіснити неможливе.',
              '2': '"Двійки" - енергія',
              '02': 'Біоенергія на низькому рівні, відкритий канал для набору. \nЛюблять антикваріат, старовинні книги',
              '12': 'Метеочутливі, потребують занять спортом, а краще йогою',
              '22': 'відносно невеликий запас біоенергії. Люди можуть стати хорошими лікарями, медсестрами',
              '32': 'Знак екстрасенса. Можливо людина і сама не підозрює, \nщо може лікувати навіть своєю присутністю',
              '42': 'цих людей дуже любить протилежну стать',
              '52': 'цих людей дуже любить протилежну стать',
              '62': 'цих людей дуже любить протилежну стать',
              '3': '"Трійки" - цікавість до точних наук та техніки',
              '03': 'Порядні люди, прекрасні господарі. \nПунктуальні, кропітку роботу виконують бездоганно',
              '13': 'Люди настрою. Не люблять економити, широкі натури',
              '23': 'Люди схильні до наук, мають аналітичний склад розуму',
              '33': 'Схильність до наук, її реалізація породжує педантичність',
              '43': 'Схильність до наук, її реалізація породжує педантичність',
              '53': 'Схильність до наук, її реалізація породжує педантичність',
              '4': "'Четвірки' - здоров'я",
              '04': "здоров'я слабке",
              '14': "здоров'я нормальне",
              '24': "міцне здоров'я",
              '34': "міцне здоров'я, велика сексуальна енергія",
              '44': "міцне здоров'я, велика сексуальна енергія",
              '54': "міцне здоров'я, велика сексуальна енергія",
              '5': "'П\'ятірки' - інтуіція",
              '05' : 'людина народилася з невідкритим каналом інтуіції.\nАктивна, намагається щось зробити',
              '15' : 'канал інтуіції відкритий, ці люди роблять менше помилок',
              '25' : 'сильно розвинена інтуїція (можуть бути слідчими або юристами)',
              '35' : 'майже ясновидці. Все, що відбувається навколо, їм зрозуміло.\nВони знають, що робити',
              '45' : 'ясновидці, таким людям підвласний час і простір',
              '55' : 'ясновидці, таким людям підвласний час і простір',
              '65' : 'ясновидці, таким людям підвласний час і простір',
              '6' : '"Шістки" - заземленность',
              '06' : 'людина прийшла у цей світ, щоб отримати професію.\nФізичний працю він не любить, але змушена займатися нею',
              '16' : 'земна людина. Думає про навчання, \n ал без фізичної роботи їй не обійтися',
              '26' : 'людина любить працювати, хоча фізична робота для неї — лише хобі',
              '36' : 'Дуже приваблива та темпераментна людина.\nЕнергетичний вампір, живиться енергією інших',
              '46' : 'ця людина у своїх попередніх земних перетвореннях\n багато і тяжко працювала',
              '56' : 'ця людина у своїх попередніх земних перетвореннях\n багато і тяжко працювала',
              '7' : '"Сімки" - талант',
              '07' : 'Людина здобуде талант через працю.\n З часом такі люди приходять до церкви',
              '17' : 'у цієї людини є неяскраво виражений талант',
              '27' : 'знак дуже талановитих людей. \nВони музичні, мають художній смак',
              '37' : 'особливий знак. Ці люди зіткнутися\n з серйозними труднощами',
              '47' : 'це знак тривоги. Люди з такою комбінацією\n цифр повинні бути дуже обачними.',
              '57' : 'це знак тривоги. Люди з такою комбінацією\n цифр повинні бути дуже обачними.',
              '67' : 'це знак тривоги. Люди з такою комбінацією\n цифр повинні бути дуже обачними.',
              '8' : '"Вісімки" - відповідальність',
              '08' : 'людина легко бере в борг, але не поспішає віддавати',
              '18' : 'людина з розвиненим почуттям відповідальності',
              '28' : 'дуже розвинене почуття відповідальності.\n Ця людина завжди готова допомогти іншим людям',
              '38' : 'людина покликана служити людям. \nМоже бути прекрасним лікарем',
              '48' : 'людина має парапсихологічні здібності,\n а також має здібності в області точних наук',
              '58' : 'людина має парапсихологічні здібності,\n а також має здібності в області точних наук',
              '68' : 'людина має парапсихологічні здібності,\n а також має здібності в області точних наук',
              '9' : " 'Дев'ятки' - розум",
              '09' : 'людям доводиться докладати багато зусиль\n для засвоєння інформації',
              '19' : 'такій людині потрібно розвивати свій розум',
              '29' : 'Розумні від народження, але не полюбляють вчитися',
              '39' : 'дуже розумні люди, прекрасні співрозмовники',
              '49' : 'людина рідкісного розуму, має інтуіцію та бачить віщі сни',
              '59' : 'людина рідкісного розуму, має інтуіцію та бачить віщі сни',
              '69' : 'людина рідкісного розуму, має інтуіцію та бачить віщі сни'} 


#функція, що відповідає за формування ключів, по яких можна звернутися в словник розшифровок
def keys_list():
    n = int
    keys = []
    for i in range(1, 10):
        n = total_numbs.count(str(i))
        keys.append(str(n)+str(i))
    return keys


#функція, що бере ключі, та повертає значення зі словника
def printer_value():
    return_list = '' #стрічку усієї інфи, що виведу в поле виводу
    
    values = []  #список підрахованих значень нумероскопа 
    keys = keys_list()
    for i in keys:
        values.append(numb_values[i[1]])
        values.append(str(int(i[0])*i[1] + '-' + numb_values[i] + '\n'))
    
    for value in values:                                #генерю загальну стрічку для виводу
        return_list = return_list + value + '\n'
        answer.config(text=return_list)

#функція, що відпрацює при натисканні кнопки. та виведе результат
def myClick():
    try:
        global total_numbs
        a = entry_field.get()
        if len(a) != 8:
            return answer.config(text ="Перевір коректність введених даних!")
        b = list(map(int, a))
        numb_1 = sum(b)
        numb_2 = numb_1 // 10 + numb_1 % 10
        numb_3 = numb_1 - b[0] * 2
        numb_4 = numb_3 // 10 + numb_3 % 10
        total_numbs = str(numb_1) + str(numb_2) + str(numb_3) + str(numb_4) + a
    
        printer_value()

    except:
        answer.config(text ="Перевір коректність введених даних!")


my_label = Label(root, text="Введи дату свого народження у форматі ДДММРРРР", font=('Axure Handwriting', 10))
my_label.pack(pady=5)

entry_field = Entry(root, width=20, font=('Axure Handwriting', 12))
entry_field.pack(padx=5, pady=5)

my_button = Button(root, text = "Підтверджуй", font=('Axure Handwriting', 10), command=myClick)
my_button.pack()

answer = Label(root, text='', font=('Axure Handwriting', 10))
answer.pack(pady=5, padx=5)

root.mainloop()
